# RevitCommandId Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitCommandId Methods
RevitCommandId Class See Also
---
The RevitCommandId type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| LookupCommandId | Looks up and retrieves the Revit command id with the given id string. |
| LookupPostableCommandId | Looks up and retrieves the Revit command id with the given id string. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
RevitCommandId Class
Autodesk.Revit.UI Namespace